testcase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

value 1e2; 
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $value;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value $value;
    }
    outlet
    {
        type            zeroGradient;
    }
    midline
    {
        type symmetryPlane;

    }
    y 
    {
        type empty;
    }
    neutralSide
    {
        type            zeroGradient;
    }
    chargedSide
    {
        type            zeroGradient;

    }
}


// ************************************************************************* //
