testcase/constant/electricProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      electricProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// WARN valid for refactored ionic..Transport 

// preample: physical constants
k_B_einv 8.617330337217213e-5 ; // because of k_B being rounded to zero, group it with e : = k_B/e
e  1.6021766208e-19;
kB  1.38064852e-23 ;
epsilon_0 8.8541878176e-12; 
F 96485.33212331001; 
R 8.134;  

// Case-specific scaling 
    ScalingConstant 25;  // ratio of wall height and lambda length
                        // technically a mesh control variable
    PsiDict { #include "$FOAM_CASE/0/Psi_E" } ;
       Psi0 $PsiDict.zeta; // zeta is the wall potential in this case
       Phi $PsiDict.Phi;
       E_field_x 1e5;
       E_field E_field [ 1 1 -3 0 0 -1  0 ] ($E_field_x 0 0);

// Bulk electrical characteristics of system
    // binary mixture characters
        epsilon_r 77.9;
        z 1;
        D 1e-9;
        T 300;

        rho_bulk #calc "1000" ;  // kg/m3
        c_bulk 0.1; // [mol/L] 
    // --> calculated characteristics
    lambda_D #calc "sqrt($epsilon_0*$epsilon_r*$k_B_einv*300/(2*$z*$z*$c_bulk*1000*$F))";


// other characters closable - time
// (controlDict cannot #calc: bug) --> ionic time control will not be class based & not be calculated src side
    // tau_1 #calc "2 * $lambda_D * pow($L,2)/  ( $H * $D * cosh( $Phi /2 ) ) " ; 
    // tau_2 #calc "4/Foam::mathematicalConstant::pi * pow($L,2)/$D " ; 
 
    // eta #calc "4 * exp( $Phi/2  ) * $lambda_D/$H";
 


// ************************************************************************* // 
