testcase/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// momentumTransportModelType compressibleMomentumTransportModel;
// momentumTransportModel  stokesCompressibleMomentumTransport; // old , before PNP is a thermophysic , for testing

momentumTransportModelType ionicMomentumTransportModel;
momentumTransportModel  MaxwellStokesIonicMomentumTransport; // TBD true type

laminar
{
    Coeffs
    {
    }
    
}

// ************************************************************************* //
