testcase/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// binary mixture properties
epsilon_r 77.9;
D 1e-9; // symmetric diffusion
z 1; // symmetric charge 
z_anion #calc  "-$z";
z_cation #calc  "$z";

mixtureType molarBasedMixture;

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       const;
    thermo          hConstThermo;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

// WARN after refactoring, for Nenst-Planck thermo type
// TODO move this to ??transport
ionic
{
    potential basic;

    ionicTimeControl None;
}

//- species properties
species
(
    K
    Cl
    // O2
    H2O
);

transferSpecies
();

K
{
    specie
    {
        nMoles          1;
        molarVolume     1;
        valenceNumber   $z_cation;
        molWeight       39.0983; 
    }
    thermodynamics
    {
        Cp      4181;
        Hf      -1.5833e7;
    }
    transport
    {
//         As              1.67212e-06;
//         Ts              170.672;
		mu 1e-3;
        Pr  1;
    }
    equationOfState
    {
        rho             1000;
    }
}
Cl
{
    specie
    {
        nMoles          1;
        molarVolume     1;
        valenceNumber   $z_anion;
        molWeight       35.453; 
    }
    thermodynamics
    {
        Cp      4181;
        Hf      -1.5833e7;
    }
    transport
    {
//         As              1.67212e-06;
//         Ts              170.672;
		mu 1e-3;
        Pr  1;
    }
    equationOfState
    {
        rho             1000;
    }
} 
H2O
{
    specie
    {
        nMoles          1;
        molWeight       18.0153;
        molarVolume     0;
        valenceNumber   0;
    }
    thermodynamics
    {
        Cp      4000;
        Hf      -1.2833e7;
    }
    transport
    {
//         As              1.67212e-06;
//         Ts              170.672;
		mu 1e-3;
        Pr  1;
    }
    equationOfState
    {
        rho             1000;
    }
}

//- chemistry
chemistryReader foamChemistryReader;
foamChemistryFile "$FOAM_CASE/constant/reactions";

//- algorithm
cycleSpecies false;
nSubCycles 1;
inertSpecie H2O;
defaultSpecie H2O;
referenceSpecie H2O;

// ************************************************************************* //
