testcase/constant/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminar
{
    Coeffs
    {
    }
    
}

// WARN after refactoring, for Nenst-Planck thermo type
ionic 
{
  // TBD
}



thermophysicalTransportModel NernstPlanckConstantUnityLewisFourierIonicThermophysicalTransportModel; 

binaryDiffusivityModel  constant; //ChapmanEnskog; //WilkeChang;

constantCoeff
{
    K-K 1e-9;
    Cl-Cl 1e-9;
    H2O-H2O 1e-9;
    K-Cl 1e-9;
    K-H2O 1e-9;
    Cl-H2O 1e-9;



}

// ************************************************************************* //
