testcase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libincompressibleRASModels.so"
    "liblduSolvers.so"
);

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         7e-5;

deltaT          1e-8;

writeControl   timeStep;
writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  20;

writeCompression uncompressed;

timeFormat      general;

timePrecision   20;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           5;

InfoSwitches
{
    allowSystemOperations 1;
} 
functions
{
    cK
    {
        type            cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  $writeInterval;

        log               true;
        valueOutput       false;
        writeToFile       true; 

        fields
        (
            cK
        );
        
        operation volIntegrate; 
        source all;
        set    allCells;
    }
    cCl
    {
        type            cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  $writeInterval;
 
        log               true;
        valueOutput       false;
        writeToFile       true; 

        fields
        (
            cCl
        );
        
        operation volIntegrate; 
        source all;
        set    allCells;
    }
 
}

DebugSwitches
{
}

// ************************************************************************* //
